notes/400-Meaning-兴趣/450-Emacs-神之编辑器/emacs-man-display.org
#+STYLE: <link rel="stylesheet" type="text/css" href="style.css" />
* 38 Emacs 显示

这单描述了Emacs 用户界面的几个特点。

** 刷新屏幕

`redraw-frame' 清除并重绘整个frame。这个函数在屏幕崩溃时特别有用。

函数： redraw-frame frame

这个函数清除并重绘 FRAME。

命令： redraw-display

这个函数清除并重绘所有可见的frame.

在Emacs 里面，处理用户输入的优先级高于屏幕显示，如果你在输入的时候调用 这些函数，它们不会立即起作用，但是在当输入被处理完成后，被要求的重绘任务会立马执行。

在文本终端，在暂停和唤醒 Emacs 的时候，通常也会重绘屏幕。有些终端模拟器会记录各个依赖于显示的程序的显示 内容。如果你在用这类终端，你可能需要禁止唤醒重绘。

用户设置： no-redraw-on-reenter

这个变量决定了 Emacs 在暂停并唤醒后是否重绘整个屏幕。 默认值是 `nil'，意思是需要重绘。否则是需要重绘。

** 强制重绘
   通常情况下，Emacs等待输入的过程中都在尝试重绘屏幕。通过以下的这些函数，你可以要求Emacs立即重绘，而不是等待输入。

   函数： redisplay &optional force
   这个函数要求立即重绘。可选的参数 FORCE ，如果不是 nil，强制redisplay执行，而不管变量`redisplay-dont-pause' 的值和输入是否在进行中。

   函数返回`t' 意味着函数已经执行过了，但是不代表执行成功了，反之亦然。它有可能是被新到 的输入给中断了。

   变量： redisplay-dont-pause
   如果这个变量的值是 `nil'，到达的输入事件会中断重绘；Emacs不会启动重绘，并且会停止所有在运行中的重绘过程，直到输入事件被处理完毕。这

   变量： redisplay-preemption-period
   决定Emacs在重显过程中每次检查输入间隔的时间，如果在这间隔中有输入，将停止重绘，并对输入进行处理，变量的默认值是0.1；如果值是nil，Emacs在重绘的过程中不会检查输入。
   
   但是这个变量在 redisplay-dont-pause 不是nil的时候是没有作用的。

虽然 redisplay 试图立即进行绘制，但是它不会改变Emacs对那部分frams进行绘制的决定。相反，下面这个函数会增加重绘任务，但是不会立即执行。

函数： force-window-update &optional object
这个函数强制Emacs在下次重绘时对部分或者全部的窗口进行重绘。如果OBJECT是一个窗口，则该窗口被重绘，如果OBJECT是frame，则其中的所有窗口都会被重绘。如果OBJECT是nil，所有的窗口会被重绘。

这个函数不会触发重绘立即执行。Emacs在等待输入的过程中或者redisplay函数被调用的时候才会处理这些任务。

** 长句截断
   
当一行文本的长度超过了窗口的最右边界，Emacs可能折行或者续行。续行不同于断行，续行只在显示上，而不是在buffer中，他在窗口的右边界精确地进行，而不是单词的边界。

在图形显示上，窗口的右边界上有一个小小的箭头表示这是一长行文字。在文本终端显示上，在最右列有一个`$'表示。

用户设置： truncate-lines
如果这个变量不是 nil，超过最右边界的文字会被截断显示，否则会折行显示。有一个例外是， truncate-partial-width-windows 变量的优先权大于 partial-width 变量。

用户设置： truncate-partial-width-windows

用户设置： wrap-prefix

** 回显区

回显区用于显示错误信息，message 函数输出和击键。它不同于minibuffer，尽管它们俩都出现在屏幕的相同地方。

*** 显示消息
    
    以下是用于在回显区显示信息的标准函数。
    函数： message format-string &rest arguments
    FORMAT-STRING 是格式字串， ARGUMENTS 是格式详述。函数的返回结果显示在回显区内，如果包含有`face'文本说明，就用设置的faces显示。同时，结果也会被添加至*Messages* buffer。

    在batch模式下，信息会被输出至标准错误流，以换行符结尾。

    如果 FORMAT-STRING 是空的，该函数清空回显区，设置回原来的大小。如果minibuffer处于激活状态，则显示minibuffer的内容。

    宏： with-temp-message message &rest body
    这个结构在执行 BODY 的过程中，在回显区内临时显示一条信息。

    函数： message-or-box format-string &rest arguments
    这个函数用一个对话框显示消息 MESSAGE.

    函数： message-box format-string &rest arguments
    如果用对话框显示不成功，则显示在回显区内。

    函数： display-message-or-buffer message &optional buffer-name not-this-window frame
    显示的内容可能是字符串或者buffer，如果长度大于回显区的宽度则重新弹出一个buffer予于显示。

    函数： current-message
    获得回显区内当前内容，如果为空则返回nil。

*** 自定义回显区

    以下变量用于控制回显区工作方式。
    变量： cursor-in-echo-area
    如果为nil，光标在point--不在回显区内，否则在消息的末尾。

    变量： echo-area-clear-hook
    这个钩子在回显区被清除的时候执行。

    用户设置： echo-keystrokes
    这个变量决定命令回显前等待的时间。必须是整数或者浮点数，代表秒。如果用户输入了前缀键（比如`C-x'），前缀键会在回显区内显示这么长的时间。

    如果其值为零，则输入命令不会显示。

    变量： message-truncate-lines
    如果变量值不是nil，显示区不会自动适应内容。

    变量 `max-mini-window-height'，用于设置minibuffer的最大高度，同样适用于回显区。

** 告警显示

   告警信息于用通知用户可能存在的问题，但是程序会继续运行。

*** 告警基础

    所有警告都有一个文本消息和一个严重程度标识。下面是可能的出现的严重程度，从上至下，严重程度降低。
    :emergency
    如果你不立即处置，Emacs会崩溃。
    :error
    报告数据或者环境所固有的错误。
    :warning
    报告数据或者环境可能引起的问题。
    :debug
    报告的信息只对你在debugging的时候有用。

    当你的程序遇到了非法的数据，它可以用`error'或者`signal'来发出消息。如果用发出Lisp error的方式，虽然最简单，但程序不能再继续运行。如果你遇到了用户错误的输入，还想保持程序继续运行，可以采用signal向用户报告严重程度为`:error'的告警信息。

    每个告警信息都有一个“warnig type“ 对其进行分类。种类是一个符号列表。第一个符号应该是自定义的用于存储用户设置的组（group）。比如，字节编译器用`(bytecomp)'作为其告警类型。只要你愿意，你可能继续细分告警类型，只是用更多的符号在来表示。

    函数： display-warning type message &optional level buffer-name

    函数： lwarn type level message &rest args

    函数： warn message &rest args
    这个函数用`(format MESSAGE ARGS...)'作为消息，`(emacs)作为类型，`:warning'作为严重程度。函数存在主要是为了兼容性考虑，不推荐用它，因为你应该设置一个明确的 warning type。
    
*** 告警变量

    通过设置以下的变量，你的程序可能自定义告警的呈现方式。

    变量： warning-levels
    这个表定义告警程度的意义和顺序。每个元素定义一个严重程度，以递减的顺序排列。

    每个元素的格式都是`(LEVEL STRING FUNCTION)'，LEVEL是定义的严重程度，STRING 是其的文本描述，STRING 应该用`%s'来设定放置告警种类信息的位置。

    变量： warning-prefix-function
    如果不是nil，它的值是一个用于产生告警前缀的函数。你可能把它绑定到一个合适的函数， display-warning 会调用它，把它的结果插入到当前的 warning buffer。

    绑定的函数应该有两个参数，严重程度和其在 warning-levels 中的入口。

    变量： warning-series

    变量： warning-fill-prefix

    变量： warning-type-format

*** 告警设置

    这些变量控制当一个lisp程度告警的时候Emacs的行为。
    用户设置: warning-minimum-level
    表示应该呈现给用户的最低严重程度的告警信息。默认值是`:warning'，即其会显示除了`:debug'信息之外的所有信息。

    用户设置： warning-minimum-log-level

    用户设置： warning-suppress-types

    用户设置： warning-suppress-log-types
    
*** 延迟告警
    有些时候，你可能希望在命令执行的时候还要显示告警信息，而是在其执行完毕之后显示。你可以用变量`delayed-warnings-list'来进行控制。

    变量： delayed-warnings-list
    这是一个延迟进行显示的告警信息的列表。每个元素都是一个列表：
    (TYPE MESSAGE [LEVEL [BUFFER-NAME]])
    当Emacs执行完`post-command-hook'后就会立即显示这个变量设置的所有告警信息。

    想要深度定制延迟告警机制的话，你可以修改 `delayed-warnings-hook'变量。

