publish/400-Meaning-兴趣/450-Emacs-神之编辑器/emacs-man-display.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2021-10-02 Sat 12:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu Peng" />
<link rel='stylesheet' type='text/css' href='https://littlevalley.github.io/mynotes/publish/css/org.css' /><link rel='stylesheet' type='text/css' href='https://littlevalley.github.io/mynotes/publish/css/header.css' />
</head>
<body>
<div id="preamble" class="status">
<div class="site_header"><div class="site_title" ><div class="title_main">WuPeng's Notes - 我的知识库</div><div class="title_sub">不积跬步，无以至千里；不积小流，无以成江海</div><div class="search"></div></div><div class="nav_bar"><ul><li><a href="https://littlevalley.github.io/mynotes/publish/index.html">笔记</a></li><li><a href="https://littlevalley.github.io/mynotes/publish/inbox.html">收集</a></li><li><a href="#contact">Contact</a></li><li style="float:right"><a href="https://littlevalley.github.io/mynotes/publish/about.html">关于</a></li></ul></div></div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfe99b37">1. 38 Emacs 显示</a>
<ul>
<li><a href="#org6c0acc7">1.1. 刷新屏幕</a></li>
<li><a href="#org1217e15">1.2. 强制重绘</a></li>
<li><a href="#orgeb9827c">1.3. 长句截断</a></li>
<li><a href="#orgf427154">1.4. 回显区</a></li>
<li><a href="#orgf8251c9">1.5. 告警显示</a></li>
<li><a href="#org1eda3b4">1.6. 隐藏文本</a></li>
<li><a href="#org898d359">1.7. 选择显示</a></li>
<li><a href="#orgeab1cc3">1.8. 临时显示</a></li>
<li><a href="#orgcac7823">1.9. 叠加</a></li>
<li><a href="#orge4f4e55">1.10. 宽度</a></li>
<li><a href="#orgdf3f8d2">1.11. 行高</a></li>
<li><a href="#orgacb1ed4">1.12. 样式</a></li>
<li><a href="#orgeccb2b1">1.13. 窗口边框</a></li>
<li><a href="#org7aa0397">1.14. 滚动条</a></li>
<li><a href="#orgd3cd825">1.15. 显示属性</a></li>
<li><a href="#org302c0d8">1.16. 图片显示</a></li>
<li><a href="#orgb597d9c">1.17. 按钮</a></li>
<li><a href="#orgba29ea0">1.18. 抽象显示</a></li>
<li><a href="#orgd630b67">1.19. 括号闪烁</a></li>
<li><a href="#org4da5976">1.20. 字符显示</a></li>
<li><a href="#org96fae77">1.21. 声音</a></li>
<li><a href="#org5de0a0e">1.22. 窗口系统</a></li>
<li><a href="#orgbb250aa">1.23. 双向显示</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe99b37" class="outline-2">
<h2 id="orgfe99b37"><span class="section-number-2">1</span> 38 Emacs 显示</h2>
<div class="outline-text-2" id="text-1">
<p>
这单描述了Emacs 用户界面的几个特点。
</p>
</div>

<div id="outline-container-org6c0acc7" class="outline-3">
<h3 id="org6c0acc7"><span class="section-number-3">1.1</span> 刷新屏幕</h3>
<div class="outline-text-3" id="text-1-1">
<p>
`redraw-frame' 清除并重绘整个frame。这个函数在屏幕崩溃时特别有用。
</p>

<p>
函数： redraw-frame frame
</p>

<p>
这个函数清除并重绘 FRAME。
</p>

<p>
命令： redraw-display
</p>

<p>
这个函数清除并重绘所有可见的frame.
</p>

<p>
在Emacs 里面，处理用户输入的优先级高于屏幕显示，如果你在输入的时候调用 这些函数，它们不会立即起作用，但是在当输入被处理完成后，被要求的重绘任务会立马执行。
</p>

<p>
在文本终端，在暂停和唤醒 Emacs 的时候，通常也会重绘屏幕。有些终端模拟器会记录各个依赖于显示的程序的显示 内容。如果你在用这类终端，你可能需要禁止唤醒重绘。
</p>

<p>
用户设置： no-redraw-on-reenter
</p>

<p>
这个变量决定了 Emacs 在暂停并唤醒后是否重绘整个屏幕。 默认值是 `nil'，意思是需要重绘。否则是需要重绘。
</p>
</div>
</div>

<div id="outline-container-org1217e15" class="outline-3">
<h3 id="org1217e15"><span class="section-number-3">1.2</span> 强制重绘</h3>
<div class="outline-text-3" id="text-1-2">
<p>
通常情况下，Emacs等待输入的过程中都在尝试重绘屏幕。通过以下的这些函数，你可以要求Emacs立即重绘，而不是等待输入。
</p>

<p>
函数： redisplay &amp;optional force
这个函数要求立即重绘。可选的参数 FORCE ，如果不是 nil，强制redisplay执行，而不管变量`redisplay-dont-pause' 的值和输入是否在进行中。
</p>

<p>
函数返回`t' 意味着函数已经执行过了，但是不代表执行成功了，反之亦然。它有可能是被新到 的输入给中断了。
</p>

<p>
变量： redisplay-dont-pause
如果这个变量的值是 `nil'，到达的输入事件会中断重绘；Emacs不会启动重绘，并且会停止所有在运行中的重绘过程，直到输入事件被处理完毕。这
</p>

<p>
变量： redisplay-preemption-period
决定Emacs在重显过程中每次检查输入间隔的时间，如果在这间隔中有输入，将停止重绘，并对输入进行处理，变量的默认值是0.1；如果值是nil，Emacs在重绘的过程中不会检查输入。
</p>

<p>
但是这个变量在 redisplay-dont-pause 不是nil的时候是没有作用的。
</p>

<p>
虽然 redisplay 试图立即进行绘制，但是它不会改变Emacs对那部分frams进行绘制的决定。相反，下面这个函数会增加重绘任务，但是不会立即执行。
</p>

<p>
函数： force-window-update &amp;optional object
这个函数强制Emacs在下次重绘时对部分或者全部的窗口进行重绘。如果OBJECT是一个窗口，则该窗口被重绘，如果OBJECT是frame，则其中的所有窗口都会被重绘。如果OBJECT是nil，所有的窗口会被重绘。
</p>

<p>
这个函数不会触发重绘立即执行。Emacs在等待输入的过程中或者redisplay函数被调用的时候才会处理这些任务。
</p>
</div>
</div>

<div id="outline-container-orgeb9827c" class="outline-3">
<h3 id="orgeb9827c"><span class="section-number-3">1.3</span> 长句截断</h3>
<div class="outline-text-3" id="text-1-3">
<p>
当一行文本的长度超过了窗口的最右边界，Emacs可能折行或者续行。续行不同于断行，续行只在显示上，而不是在buffer中，他在窗口的右边界精确地进行，而不是单词的边界。
</p>

<p>
在图形显示上，窗口的右边界上有一个小小的箭头表示这是一长行文字。在文本终端显示上，在最右列有一个`$'表示。
</p>

<p>
用户设置： truncate-lines
如果这个变量不是 nil，超过最右边界的文字会被截断显示，否则会折行显示。有一个例外是， truncate-partial-width-windows 变量的优先权大于 partial-width 变量。
</p>

<p>
用户设置： truncate-partial-width-windows
</p>

<p>
用户设置： wrap-prefix
</p>
</div>
</div>

<div id="outline-container-orgf427154" class="outline-3">
<h3 id="orgf427154"><span class="section-number-3">1.4</span> 回显区</h3>
<div class="outline-text-3" id="text-1-4">
<p>
回显区用于显示错误信息，message 函数输出和击键。它不同于minibuffer，尽管它们俩都出现在屏幕的相同地方。
</p>
</div>

<ol class="org-ol">
<li><a id="orga3dc657"></a>显示消息<br />
<div class="outline-text-4" id="text-1-4-1">
<p>
以下是用于在回显区显示信息的标准函数。
函数： message format-string &amp;rest arguments
FORMAT-STRING 是格式字串， ARGUMENTS 是格式详述。函数的返回结果显示在回显区内，如果包含有`face'文本说明，就用设置的faces显示。同时，结果也会被添加至*Messages* buffer。
</p>

<p>
在batch模式下，信息会被输出至标准错误流，以换行符结尾。
</p>

<p>
如果 FORMAT-STRING 是空的，该函数清空回显区，设置回原来的大小。如果minibuffer处于激活状态，则显示minibuffer的内容。
</p>

<p>
宏： with-temp-message message &amp;rest body
这个结构在执行 BODY 的过程中，在回显区内临时显示一条信息。
</p>

<p>
函数： message-or-box format-string &amp;rest arguments
这个函数用一个对话框显示消息 MESSAGE.
</p>

<p>
函数： message-box format-string &amp;rest arguments
如果用对话框显示不成功，则显示在回显区内。
</p>

<p>
函数： display-message-or-buffer message &amp;optional buffer-name not-this-window frame
显示的内容可能是字符串或者buffer，如果长度大于回显区的宽度则重新弹出一个buffer予于显示。
</p>

<p>
函数： current-message
获得回显区内当前内容，如果为空则返回nil。
</p>
</div>
</li>

<li><a id="orgbebb414"></a>自定义回显区<br />
<div class="outline-text-4" id="text-1-4-2">
<p>
以下变量用于控制回显区工作方式。
变量： cursor-in-echo-area
如果为nil，光标在point&#x2013;不在回显区内，否则在消息的末尾。
</p>

<p>
变量： echo-area-clear-hook
这个钩子在回显区被清除的时候执行。
</p>

<p>
用户设置： echo-keystrokes
这个变量决定命令回显前等待的时间。必须是整数或者浮点数，代表秒。如果用户输入了前缀键（比如`C-x'），前缀键会在回显区内显示这么长的时间。
</p>

<p>
如果其值为零，则输入命令不会显示。
</p>

<p>
变量： message-truncate-lines
如果变量值不是nil，显示区不会自动适应内容。
</p>

<p>
变量 `max-mini-window-height'，用于设置minibuffer的最大高度，同样适用于回显区。
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf8251c9" class="outline-3">
<h3 id="orgf8251c9"><span class="section-number-3">1.5</span> 告警显示</h3>
<div class="outline-text-3" id="text-1-5">
<p>
告警信息于用通知用户可能存在的问题，但是程序会继续运行。
</p>
</div>

<ol class="org-ol">
<li><a id="org42184cc"></a>告警基础<br />
<div class="outline-text-4" id="text-1-5-1">
<p>
所有警告都有一个文本消息和一个严重程度标识。下面是可能的出现的严重程度，从上至下，严重程度降低。
:emergency
如果你不立即处置，Emacs会崩溃。
:error
报告数据或者环境所固有的错误。
:warning
报告数据或者环境可能引起的问题。
:debug
报告的信息只对你在debugging的时候有用。
</p>

<p>
当你的程序遇到了非法的数据，它可以用`error'或者`signal'来发出消息。如果用发出Lisp error的方式，虽然最简单，但程序不能再继续运行。如果你遇到了用户错误的输入，还想保持程序继续运行，可以采用signal向用户报告严重程度为`:error'的告警信息。
</p>

<p>
每个告警信息都有一个“warnig type“ 对其进行分类。种类是一个符号列表。第一个符号应该是自定义的用于存储用户设置的组（group）。比如，字节编译器用`(bytecomp)'作为其告警类型。只要你愿意，你可能继续细分告警类型，只是用更多的符号在来表示。
</p>

<p>
函数： display-warning type message &amp;optional level buffer-name
</p>

<p>
函数： lwarn type level message &amp;rest args
</p>

<p>
函数： warn message &amp;rest args
这个函数用`(format MESSAGE ARGS&#x2026;)'作为消息，`(emacs)作为类型，`:warning'作为严重程度。函数存在主要是为了兼容性考虑，不推荐用它，因为你应该设置一个明确的 warning type。
</p>
</div>
</li>

<li><a id="orge1128cd"></a>告警变量<br />
<div class="outline-text-4" id="text-1-5-2">
<p>
通过设置以下的变量，你的程序可能自定义告警的呈现方式。
</p>

<p>
变量： warning-levels
这个表定义告警程度的意义和顺序。每个元素定义一个严重程度，以递减的顺序排列。
</p>

<p>
每个元素的格式都是`(LEVEL STRING FUNCTION)'，LEVEL是定义的严重程度，STRING 是其的文本描述，STRING 应该用`%s'来设定放置告警种类信息的位置。
</p>

<p>
变量： warning-prefix-function
如果不是nil，它的值是一个用于产生告警前缀的函数。你可能把它绑定到一个合适的函数， display-warning 会调用它，把它的结果插入到当前的 warning buffer。
</p>

<p>
绑定的函数应该有两个参数，严重程度和其在 warning-levels 中的入口。
</p>

<p>
变量： warning-series
</p>

<p>
变量： warning-fill-prefix
</p>

<p>
变量： warning-type-format
</p>
</div>
</li>

<li><a id="orgd3b6a88"></a>告警设置<br />
<div class="outline-text-4" id="text-1-5-3">
<p>
这些变量控制当一个lisp程度告警的时候Emacs的行为。
用户设置: warning-minimum-level
表示应该呈现给用户的最低严重程度的告警信息。默认值是`:warning'，即其会显示除了`:debug'信息之外的所有信息。
</p>

<p>
用户设置： warning-minimum-log-level
</p>

<p>
用户设置： warning-suppress-types
</p>

<p>
用户设置： warning-suppress-log-types
</p>
</div>
</li>

<li><a id="org53ceb55"></a>延迟告警<br />
<div class="outline-text-4" id="text-1-5-4">
<p>
有些时候，你可能希望在命令执行的时候还要显示告警信息，而是在其执行完毕之后显示。你可以用变量`delayed-warnings-list'来进行控制。
</p>

<p>
变量： delayed-warnings-list
这是一个延迟进行显示的告警信息的列表。每个元素都是一个列表：
(TYPE MESSAGE [LEVEL [BUFFER-NAME]])
当Emacs执行完`post-command-hook'后就会立即显示这个变量设置的所有告警信息。
</p>

<p>
想要深度定制延迟告警机制的话，你可以修改 `delayed-warnings-hook'变量。
</p>
</div>
</li>
</ol>
</div>
