publish/400-Meaning-兴趣/450-Emacs-神之编辑器/emacs-man-display.html

<div id="outline-container-org1eda3b4" class="outline-3">
<h3 id="org1eda3b4"><span class="section-number-3">1.6</span> 隐藏文本</h3>
<div class="outline-text-3" id="text-1-6">
<p>
使用`invisible'属性，你可以使字符不可见，让它们不显示在屏幕上。这可以是文本属性，也可以是叠加属性。而且这些字符一般不会影响光标的移动；如果命令结束的地方在不可见区内，会把光标的位置定在文本的另一端。
</p>

<p>
最简单的情况下，任何非nil的`invisible'属性将使字符不可见。如果你没有计划手动设置 `buffer-invisibility-spec'的话，你应该将`invisible'设置成`t'。
更普遍的是，你可以用`buffer-invisibility-spec'来控制`invisible'值的意义。这允许你通过给文本设置不同的`invisible'值来把文本进行分类。
</p>

<p>
通过`buffer-invisibility-spec'来控制文本的显示属性来显示数据库的条目时特别有用。因为你可以容易实现一个过滤器来查看数据库中的某一部分。设置这个变量非常快，比扫描buffer中的所有文本来改变其属性要快很多。
</p>

<p>
变量： buffer-invisibility-spec
`t'
当`invisible'的值不是nil的时候，字符可见。
列表
列表中的每一个元素是一个显示的准则；如果一个字符的`invisible'属性与之匹配，那这个字符就不可见。列表可以有两种元素：
ATOM
如果字符的`invisible'属性值是ATOM或者其值是一个列表，但有一个成员是ATOM，则该字符不可见。
</p>

<p>
（ATOM . t）
与上一项同，但多个具有隐藏属性的字符会显示成省略号。
</p>

<p>
有两个函数用于给`buffer-invisibility-spec'添加和移除元素。
</p>

<p>
函数： add-to-invisibility-spec element
函数： remove-from-invisibility-spec element
</p>

<p>
一个约定俗成的用法是，一个主模式应该用该模式自己的名字作为`buffer-invisibility-spec'的一个元素，和`invisible'的值。
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">&#22914;&#26524;&#20320;&#24819;&#26174;&#31034;&#30465;&#30053;&#21495; </span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-to-invisibility-spec '<span class="org-rainbow-delimiters-depth-2">(</span>my-symbol . t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">&#22914;&#26524;&#20320;&#19981;&#24819;&#26174;&#31034;&#30465;&#30053;&#21495;</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-to-invisibility-spec 'my-symbol<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>overlay-put <span class="org-rainbow-delimiters-depth-2">(</span>make-overlay beginning end<span class="org-rainbow-delimiters-depth-2">)</span>
             'invisible 'my-symbol<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">When done with the invisibility:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>remove-from-invisibility-spec '<span class="org-rainbow-delimiters-depth-2">(</span>my-symbol . t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Or respectively:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>remove-from-invisibility-spec 'my-symbol<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">If you want to display an ellipsis:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-to-invisibility-spec '<span class="org-rainbow-delimiters-depth-2">(</span>my-symbol . t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">If you don't want ellipsis:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>add-to-invisibility-spec 'my-symbol<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>overlay-put <span class="org-rainbow-delimiters-depth-2">(</span>make-overlay beginning end<span class="org-rainbow-delimiters-depth-2">)</span>
             'invisible 'my-symbol<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">When done with the invisibility:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>remove-from-invisibility-spec '<span class="org-rainbow-delimiters-depth-2">(</span>my-symbol . t<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Or respectively:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>remove-from-invisibility-spec 'my-symbol<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
你可以用以下的函数的检查看不见的字符。
</p>

<p>
函数： invisible-p pos-or-prop
如果 POS-OR-PROP 是标记或者数字，函数返回non-`nil'来表示所指位置是不可见的。
</p>

<p>
如果 POS-OR-PROP 是其他 Lisp 对象，那可能是
</p>
</div>
</div>

<div id="outline-container-org898d359" class="outline-3">
<h3 id="org898d359"><span class="section-number-3">1.7</span> 选择显示</h3>
<div class="outline-text-3" id="text-1-7">
<p>
选择显示指的是用于隐藏某一行的一组相关特征。
</p>

<p>
第一种变体是，明确选择显示：通过修改文本的属性来控制行的隐显。这种隐藏在某方面有些像`invisible'属性的效果。
</p>

<p>
第二种变体，要隐藏的行是通过缩进自动选定的。这个变体是被设计成用户层特征。
</p>

<p>
你控制明确选择显示的方式是将新行符(control-j)替换成回车符(control-m)。回车符后面的行将隐藏。严格地说，它只是暂时不是一行了而已，它现在只是前面那一行的一部分了。
</p>

<p>
选择显示不会直接影响到编辑命令。
</p>
</div>
</div>

<div id="outline-container-orgeab1cc3" class="outline-3">
<h3 id="orgeab1cc3"><span class="section-number-3">1.8</span> 临时显示</h3>
<div class="outline-text-3" id="text-1-8">
<p>
临时显示主要是Lisp程序在buffer中向用户展示相关信息但不提供编辑功能的方法。许多帮助命令使用这个特性。
</p>

<p>
宏： with-output-to-temp-buffer buffer-name forms&#x2026;
这个函数先执行FORMS，然后将相关结果插入以BUFFER-NAME命名的buffer中，再将其置入Help模式。最后，在窗口中显示buffer,但是不处于选择状态。
如果FORMS不改变输出窗口的主模式，所以在执行结束以后仍然是Help模式，
</p>
</div>
</div>

<div id="outline-container-orgcac7823" class="outline-3">
<h3 id="orgcac7823"><span class="section-number-3">1.9</span> 叠加</h3>
<div class="outline-text-3" id="text-1-9">
<p>
你可以用叠加来改变buffer里面文本在屏幕上的外观。叠加是属于特定buffer的一个对象，它有指定的起始和结尾。它也具有可以检查和设置的属性，，这些属性影响叠加文本的显示。
</p>

<p>
叠加的视觉效果和文本属性是一样的。但是，因为实现不同，通常情况下，叠加的延展性不好（许多操作花费的时间和buffer中的叠加的数量是成正比的）。如果你想要改变buffer中许多片断的视觉效果，我们推荐用文本属性。
</p>

<p>
叠加用标记来记录它的开始和结尾，这样，编辑文本会调整它的开始和结尾。当你创建叠加，你可以设定在叠加起始位置插入的文本是属于叠加里面还是叠加外面，其尾部插入的文本也一样。
</p>
</div>
</div>

<div id="outline-container-orge4f4e55" class="outline-3">
<h3 id="orge4f4e55"><span class="section-number-3">1.10</span> 宽度</h3>
<div class="outline-text-3" id="text-1-10">
<p>
因为不是所有的字符都有相同的宽度，这些函数允许你检查字符的宽度。
函数： char-width char
该函数返回字符CHAR的所占的列数。
函数： string-width string
如果字符串STRING在当前窗口中，则返回其所占的列数。
函数： truncate-string-to-width string width &amp;optional start-column padding ellipsis
该函数从STRING中截取WIDTH长度的新字符串。
如果STRING的长度小于WIDTH，则返回STRING。
</p>
</div>
</div>

<div id="outline-container-orgdf3f8d2" class="outline-3">
<h3 id="orgdf3f8d2"><span class="section-number-3">1.11</span> 行高</h3>
<div class="outline-text-3" id="text-1-11">
<p>
行高是行内容高度和垂直行距之和。
行内高是行中最高的字符或者是图片的高度，如果有新行的话还包括新行符。
</p>

<p>
有许多方法可以设置更大的行高，要么设置绝对显示行高，要么设置行间距。但是，不管采取怎样的方法，实际的行距都不会比默认的小。
</p>

<p>
可以用新行符的`line-height'文本属性或者叠加属性来控制其高度。
</p>

<p>
如果该属性值为`t'，新行符不会影响该行行高，行高由行内容所决定。这对插入小的图片很有用，因为不用手动在图片之间添加空白行。
</p>

<p>
如果该属性值是具如下形式的列表(HEIGHT TOTAL)，则会在当前行的下方添加额外的空白。首先，Emacs会用HEIGHT来控制当前行上方的额外空白，然后，它在他在其下方添加足够的空白来使总行高达到TOTAL。在这种情况下，所有其他设置行间距的方式都是无效的。
</p>
</div>
</div>

<div id="outline-container-orgacb1ed4" class="outline-3">
<h3 id="orgacb1ed4"><span class="section-number-3">1.12</span> 样式</h3>
<div class="outline-text-3" id="text-1-12">
<p>
样式是显示文本的一系列图形属性的集合：字体，前景色，背景色，可选的下划线，等等。样式决定了文本以及mode line的显示方式。
</p>

<p>
表示样式的一种方式是用列表，如（:foreground "red" :weight bold）。你可以将这样的匿名样式作为文本的`face'属性，这会让Emacs将其后的文本用该样式来显示。
</p>

<p>
通常情况下，样式通过样式名来引用，样式名是一个与样式属性绑定在一起的Lisp符号。样式名通过`defface'进行定义。
</p>

<p>
Emacs在许多地方只接受样式名，而不接受匿名样式。比如 Attribute Functions，和`font-lock-keywords'变量。
</p>

<p>
为向后兼容，你也可以用一个字符串来设置样式名，这和Lisp符号是等效的。
</p>
</div>

<ol class="org-ol">
<li><a id="org5a7502e"></a>样式属性<br />
<div class="outline-text-4" id="text-1-12-1">
<p>
样式属性决定了样式的显示效果，下表列出了所有的样式属性，及它们的值和效果。
</p>

<p>
除开下面给出的值以外，每个样式属性都可以设置成`unspecified'。这个特殊值的意思是新式没有直接设置该属性，让Emacs参照其父样式或者其子样式执行。`default'样式必须明确设置所有的属性。
</p>

<p>
有些属性只在特殊情况下有作用，如果不能处理它，则会被忽略。
</p>

<p>
    `:family' 字体
    `:foundry'
    `:width'  相对于字符宽度。其值应该是以下这些符号中的一个：`ultra-condensed', `extra-condensed', `condensed',
     `semi-condensed', `normal', `semi-expanded', `expanded',
     `extra-expanded', or `ultra-expanded'.
    `:height' 字的高度，最简单的情况是以1/10点为单位的整数。
    `:weight' 字的大小，其值应该是以下这些符号中的一个：`ultra-bold', `extra-bold', `bold', `semi-bold', `normal',
     `semi-light', `light', `extra-light', or `ultra-light'. 
    `:slant' 字体倾斜，其值应该是以下符号中的一个：`italic', `oblique', `normal',
     `reverse-italic', or `reverse-oblique'。
    `:foreground' 前景色，一个字符串。其值可能是系统定义的颜色名，或者十六进制代表的颜色。
    `:background' 背景色，一个字符串。
    `:underline' 下划线。当其值为nil时，无下划线；当为t时，用前景色添加下划线；当为COLOR时，用指定的颜色添加下划线；当其值为(:color COLOR :style STYLE)时，用指定的颜色和样式。
    `:overline' 上划线，如果其值是t，用样式的前景色；如果其值为字符串，则用字符串指定的颜色；如果其值为nil，则不划线。
    `:strike-through' 删除线，其用法同overline。
    `:box' 方框，如为nil，则无方框；如果为t，则用宽度为1的线、前景色画方框；如果为COLOR，则用宽度为1，COLOR颜色的线画方框；如果为(:line-width WIDTH :color COLOR :style STYLE)，则用指定的样式画方框，WIDTH默认值为1，若其值为-N，意思是说用宽度为N的线在方本下方的空白处画线，而不会增加字符的宽和高。COLOR指定画框的颜色，默认情况下，对于简单的框，使用样式的前景色，对于3D框，还会用到背景色。STYLE指明是否需要画3D的框，如果其值为`released-button'，画出的框看起来像未被按下的按钮，如果其值为`pressed-button'，画出的框像按下的按钮，如果忽略它的值或者设为nil，则画一个普通的平面框。
    `:inverse-video' 倒转视频。其值应该为t和nil中的一个。
    `:stipple' 点画背景，位图。其值可能是包含X位图数据文件的文件名。该文件被查找的路径由变量`x-bitmap-file-path'指定。stipple的值也可以直接指定位图数据，其格式为`(WIDTH HEIGHT DATA)，WIDTH和HEIGHT设置像素的宽度，DATA是包含位置像素数据的字符串，从行到列排列。每行占用(WIDTH+7)/8个连续的字节，也就是说每行至少占用1个整字节。如果stipple的值为nil，则无背景图。通常情况下，你不需要设置stipple属性，因为他自动处理灰度阴影。
    `:font' 字体。其值应该为字体对象。当用`set-face-attribute'
给其赋值时，你还需要提供字体说明、字体实例，或者一个字符串。Emacs会将这样的数值转换成合适的字体对象，并将其存储为实际的font属性值。如果你用字符串，则应该是字体名；如果字体名是XLFD并包含通配符，Emacs会选择第一个与之匹配的字体。要注意的是给这个属性赋值会同时改变 `:family', `:foundry', `:width', `:height',
     `:weight', and `:slant'这些变量的值。
    `:inherit' 父样式的名字，也可以是样式名串。从父样式继承的样式会作为基本样式。如果是样式名列表，则排在前面的样式会覆盖其后的样式。
</p>

<p>
函数： font-family-list &amp;optional frame
返回值为字体簇的名字列表。FRAME设置要进行显示的frame，如果为nil，则使用处于选择状态的frame。
</p>

<p>
用户设置： underline-minimum-offset
用像素值设置基线和下划线之间的最小距离。
</p>

<p>
用户设置： x-bitmap-file-path
给`:stipple'属性提供搜寻文件的目录列表。
</p>

<p>
函数： bitmap-spec-p object
如果OBJECT是用于`:stipple'的合法的位图数据，则返回t，否则返回nil。
</p>
</div>
</li>
