publish/400-Meaning-兴趣/450-Emacs-神之编辑器/emacs-man-display.html

<li><a id="org40ed139"></a>定义样式<br />
<div class="outline-text-4" id="text-1-12-2">
<p>
宏： defface face spec doc [keyword value]&#x2026;
此宏定义新的样式FACE，所有的默认值由SPEC指定。还要将FACE引起来，并且不要以`-face'结束，DOC是该样式的说明文档，附加的KEYWORD的意义同`defgroup'和`defcustom'。
当此宏运行时，它会用SPEC定义一个新样式，同时从init文件中读入自定义样式对其进行覆盖。
当你在Emacs Lisp模式中用`C-M-x‘来运行此宏，其结果会覆盖所有自定义的样式。
SPEC参数是样式说明，针对不同的终端有不同的显示说明。其形式是：
(DISPLAY . PLIST)
DISPLAY 指明终端种类，PLIST是样式属性列表。为了向后兼容，SPEC也可以用如下形式`(DISPLAY PLIST)。
</p>

<p>
DISPLAY的可能值有：
`default' 此元素不和任何终端匹配，但是它指定的是所有终端的默认值，如果使用default，则应该是SPEC的第一个元素。所有接在其后的元素都可将其覆盖。
`t' 此元素则匹配所有的终端，因此所有接在其后的元素均不会被使用。此元素应该是列表的最后一个元素。
a list 如果DISPLAY是列表的话，应该使用如下形式：`(CHARACTERISTIC VALUE&#x2026;)。
</p>
</div>
</li>

<li><a id="org6d17da8"></a>样式属性函数<br />
<div class="outline-text-4" id="text-1-12-3">
<p>
函数： set-face-attribute face frame &amp;rest arguments
通过此种方式设置的样式属性会覆盖掉所有用defface定义的样式。
ARGUMENTS 定义要设置的属性和它们的值。示例如下：
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span class="org-rainbow-delimiters-depth-1">(</span>set-face-attribute 'foo nil
                    <span class="org-builtin">:width</span> 'extended
                    <span class="org-builtin">:weight</span> 'bold<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
如果FRAME的值为t，该函数设置新frame的样式默认值，如果FRAME的值为nil，则样式影响已经存在的frames和新frames。
</p>

<p>
函数： face-attribute face attribute &amp;optional frame inherit
函数返回指定或者当前frame上应用的FACE样式的属性值。如果你没有用 set-face-attribute 设置过，则返回值为nil。
</p>
</div>
</li>

<li><a id="org8fcef0c"></a>样式显示<br />
<div class="outline-text-4" id="text-1-12-4">
<p>
Emacs在显示文本的时候遇到多种对显示效果的定义时是这样处置的。
</p>
<ul class="org-ul">
<li>如果文本包含glyph，由glyph定义新样式。</li>
<li>如果文本位于活动区域内，则用`region‘样式。</li>
<li>如果文本位于有意义的叠加中，则用叠加定义的样式；如果叠加中有`mouse-face'属性，并且鼠标处于相当近的位置，Emacs会用`mouse-face'显示文本。
如果同一字符上定义了多个叠加，则高优先权的覆盖低优先权的。</li>
<li>如果文本包含了`face'和`mouse-face'属性，则用这些属性。</li>
<li>如果文本位于模式行中，用`mode-line'样式。在首行中，则用`header-line'样式。</li>
<li><p>
如果没有设置任何属性，则用默认的样式。
</p>

<p>
在任何阶段，如果样式的`:inherit'属性是合法的，则将当前样式中值为`unspecified'的属性从父样式中拷贝。若其父样式中的此属性值亦为`unspecified'则继续往上追溯。
</p></li>
</ul>
</div>
</li>

<li><a id="orgd700ae8"></a>样式重映射<br />
<div class="outline-text-4" id="text-1-12-5">
<p>
变量： face-remapping-alist
变量是一个嵌套列表，它的元素形式为`(FACE .REMAPPING)。它让Emacs用REMAPPING样式来显示原来指定用FACE样式进行显示的文本。
如果`face-remapping-alist'是一个局部变量的话，其只作用于与其绑定的buffer。
</p>

<p>
<b>注意</b> 样式重映射不会递归。
</p>

<p>
下面有一些高层的设置 face-remapping-alist 变量的接口函数。推荐用这些函数来修改此变量，而不是手动直接修改它。这些函数只会把 face-remapping-alist 当作局部变量来对待。并且总是使用如下的结构来处理此变量。
</p>

<p>
（FACE RELATIVE-SPEC-1 RELATIVE-SPEC-2 &#x2026; BASE-SPEC）
</p>

<p>
如上所述，每个 RELATIVE-SPEC-N 要么是样式名，要么是一个由“属性/值”对构成的列表。 RELATIVE-SPEC-N 由函数 `face-remap-add-relative' 和函数 `face-remap-remove-relative' 来管理，而 BASE-SPEC 的优先级最低，由函数 `face-remap-set-base' 和函数 `face-remap-set-base' 来管理。
</p>

<p>
函数： face-remap-add-relative face &amp;rest specs
该函数将FACE中定义的属性映射成SPECS中定义的样子。其返回值是一个Lisp 对象，你可以将其传递给 face-remap-remove-relative 来删除映射关系。
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">&#23558; `</span><span class="org-comment"><span class="org-constant">escape-glyph</span></span><span class="org-comment">' &#26679;&#24335;&#26144;&#23556;&#25104;&#30001;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">`</span><span class="org-comment"><span class="org-constant">highlight</span></span><span class="org-comment">' &#21644; `</span><span class="org-comment"><span class="org-constant">italic</span></span><span class="org-comment">' &#23450;&#20041;&#30340;&#26032;&#26679;&#24335;:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>face-remap-add-relative 'escape-glyph 'highlight 'italic<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">&#20462;&#25913; `</span><span class="org-comment"><span class="org-constant">default</span></span><span class="org-comment">' &#26679;&#24335;&#20013;&#39640;&#24230;&#20026; 150%:</span>
<span class="org-rainbow-delimiters-depth-1">(</span>face-remap-add-relative 'default <span class="org-builtin">:height</span> 1.5<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orga04c073"></a>样式自动应用<br />
<div class="outline-text-4" id="text-1-12-6">
<p>
这个钩子是自动在buffer中的文本上应用样式的，它是Jit-Lock模式的部分实现，在Font-Lock里面用到。
变量： fontification-functions
这个变量是Emacs在重绘时要调用的函数的容器，但是在重绘前调用。即使 Font Lock 模式没有被激活，它们也会被调用的。当 Font Lock 模式被激活时，这个变量里面通常只有一个函数： `jit-lock-function'。
变量里面的函数会被依次调用，只有一个参数： buffer里面的位置POS。也就是从POS开始应用样式。
该函数应该在 face 属性中记录 buffer 中应用的样式名。同时还要给添加了样式的文本的`fontified'属性设置一个非空的值，以告知重绘程序样式被应用到这些文本上了。
如果在POS之后的某些文本上已经有非空的`fontified'属性，最好不要去动它们，但这不是必须的，只是会将前面的设置覆盖掉。
为效率着想，建议每次调用函数只对400至600个字符应用样式。
</p>
</div>
</li>

<li><a id="orga354cef"></a>基本样式<br />
<div class="outline-text-4" id="text-1-12-7">
<p>
如果你想在文本上应用样式，建议用原来已有的样式或者是从已有的样式上继承来定义新的样式，而不是定义一个全新的样式。这样的话，如果其他用户已经给Emacs定义了一个样式，你的程序会使用他，而不需要重新自定义。
下面是一些Emacs里面定义的基本样式，你可能想用 Font Lock 样式来达到语法高亮。
`default' 默认样式，它的所有的属性值都有明确的设置。其他的样式直接或者间接地继承于它。
`bold'
`italic'
`bold-italic'
`underline'
`fixed-pitch'
`variable-pitch'
上面这6个样式只设置了以它们的名字命名的属性，其他的属性全部是`unspecified'。
`shadow' 针对无效的文本。比如，在minibuffer中在文件名中不关心的部分用些样式。
`link'
`link-visited'
上面这2个样式针对可以点击的文本按钮，可以定位至buffer中其他地方。
`highlight' 针对那些需要临时放大以引人注目的文本。比如在`mouse-face'中做到鼠标高亮。
`match' 针对与搜索命令匹配的文本。
`error'
`warning'
`success'
以上3个模式针对那些关心错误、警告和成功的文本。比如这些样式用在`*Compilation*' buffer中的消息文本上。
</p>
</div>
</li>

<li><a id="org16fe565"></a>字体选择<br />
<div class="outline-text-4" id="text-1-12-8">
<p>
当Emacs在图形显示器上绘制字符之前，它必须选择一种字体。通常Emacs选择针对当前字符的样式中`:family'、`:weight'、`:slant'和`:width'属性设置的字体。同时显示的效果也取决于要显示的字符，因为有些字体只包含一小部分字符。如果没有字体满足要求，Emacs会使用与之最近似匹配的字体。下面的这些变量控制Emacs如何选择字体：
</p>

<p>
用户设置： face-font-family-alternatives
如果样式中设置的字体不存在，用这个变量中设置的字体进行尝试。变量中的每个元素应该具有以下的形式：
(FAMILY ALTERNATE-FAMILIES&#x2026;)
如果样式中的FAMILY不可用，则尝试 ALTERNATE-FAMILIES 中给出的字体，直到找到一个存在的字体。
</p>

<p>
用户设置： face-font-selection-order
如果没有字体满足样式中的所有属性： (`:width', `:height', `:weight', and `:slant')，则由这个变量决定这些属性被满足的优先顺序。变量的值是包含前面这4个属性符号的列表。默认情况下是： `(:width :height :weight
 :slant)'。
</p>

<p>
用户设置： face-font-registry-alternatives
在设置的registry不存在的情况下，该变量让Emacs尝试其他的registries。变量中的每个元素应该是如下形式：
(REGISTRY ALTERNATE-REGISTRIES&#x2026;)
Emacs会尝试 ALTERNATE-REGISTRIES 中的条目，直到找到为至。
</p>

<p>
Emacs可以使用可变字体，但是默认情况下它不会使用。
用户设置： scalable-fonts-allowed
这个变量指定Emacs可以使用的可变字体。默认情况下其值为nil，意思是不使用可变字体，如果是t，则可以使用任何可变字体。否则，其值必须是一个列表。然后，如果某个可变字体与列表中的表达式相匹配的话，Emacs会使用它。例如：
(setq scalable-fonts-allowed '("muleindian-2\("))
    允许Emacs使用注册为 `muleindian-2\)' 的可变字体。
</p>

<p>
变量： face-font-rescale-alist
该变量设置样式的缩放系数。其值应该是下面这种形式的集合。
(FONTNAME-REGEXP . SCALE-FACTOR)
如果FONTNAME-REGEXP 与将要使用的字体相匹配的话，则根据 SCALE-FACTOR 选择一个更大的相似的字体。当某些字体比通常的要大或者要小的时候，你可以使用这个变量来改变它看起来的大小。
</p>
</div>
</li>

<li><a id="orgfbf1be6"></a>字体集<br />
<div class="outline-text-4" id="text-1-12-9">
<p>
字体集是不同范围编码的字体的集合。一个单独的字体不能满足所有Emacs支持的显示所有字符的需要，但是字体集可以。字体集像字体一样有它的名字，在为frame或者face设置字体的时候，你同样可以使用字体集。下面是在Lisp程序中定义字体集的方法。
</p>

<p>
函数： create-fontset-from-fontset-spec fontset-spec &amp;optional style-variant-p noerror
函数根据说明字符串 FONTSET-SPEC 定义一个新的字体集， FONTSET-SPEC  应该具有下列形式：
</p>

<p>
FONTPATTERN,[CHARSET:FONT]&#x2026;
在逗号前后的空格会被忽略。
</p>

<p>
FONTPATTERN应该是标准X字体名字，CHARSET和FONT应该是`fontset-ALIAS'。
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgeccb2b1" class="outline-3">
<h3 id="orgeccb2b1"><span class="section-number-3">1.13</span> 窗口边框</h3>
<div class="outline-text-3" id="text-1-13">
<p>
在图形显示中，Emacs在每个窗口的两边显示边框，在其中显示位图来表示行截断、行延续、水平滚动等等。
</p>
</div>

<ol class="org-ol">
<li><a id="org4218bcf"></a>边缘大小和位置<br />
<div class="outline-text-4" id="text-1-13-1">
<p>
以下这些局部变量控制显示buffer的窗口边框的位置和宽度。
</p>

<p>
变量： fringes-outside-margins
边框通常情况下出现在显示边缘和窗口文字之间，如果其值不是nil，它们出现在显示区域的外面。
</p>

<p>
变量： left-fringe-width
如果值不是nil，该值为左边框的像素宽度，如果其值为nil，左边框的宽度应该和窗口的frame相同。
</p>

<p>
变量： right-fringe-width
如果值不是nil，该值为右边框的像素宽度，如果其值为nil，右边框的宽度应该和窗口的frame相同。
</p>

<p>
如果buffer不设置这些变量的话，Emacs将使用frame参数：`left-fringe'和`right-fringe'来绘制窗口的边框。
</p>

<p>
上面这些变量在`set-window-buffer'函数中才会真正起作用，这个函数会调用`set-window-fringes'。如果你更改了这些变量中的一个，边框的显示不会立即刷新，除非你调用`set-window-buffer'，此时所有的窗口都会受到影响，当然，你也可以在单独的窗口中调用`set-window-fringes'。
</p>

<p>
函数： set-window-fringes window left &amp;optional right outside-margins
这个函数设置窗口WINDOW的宽度，如果WINDOW的值是nil，则作用于当前窗口。
LEFT参数设置左边框的像素，RIGHT设置右边框的像素。如果为nil，则用默认值。如果 OUTSIDE-MARGINS不是nil，意思是说边框应该显示在显示边缘的外面。
</p>

<p>
函数： window-fringes &amp;optional window
该函数返回窗口WINDOW的边框信息，如果WINDOW值为nil，则作用于当前窗口。取得的值的形式是：`(LEFT-WIDTH RIGHT-WIDTH OUTSIDE-MARGINS)'。
</p>
</div>
</li>
</ol>
</div>
