notes/400-Meaning-兴趣/450-Emacs-神之编辑器/emacs-man-display.org
** 滚动条
   通常情况下，frame参数`vertical-scroll-bars'决定窗口是否有垂直滚动条，垂直滚动条是在左边还是右边。frame参数`scroll-bar-width'则控制滚动条的宽度。

   函数： frame-current-scroll-bars &optional frame
   该函数返回FRAME的滚动条设置，返回值的形式是`(VERTICAL-TYPE . HORIZONTAL-TYPE)'，其中 VERTICAL-TYPE 的值是 `left'、`right'、和nil中的一个， HORIZONTAL-TYPE 用来设置水平滚动条的类型，但是因为还没有实现，所以其值始终是nil。
   你可以通过修改`vertical-scroll-bars'变量来显示或者隐藏特定buffer的滚动条，该变量自动转化为局部变量。可能的值为`left'、`right'、`t'和`nil'，其中，t代表用frame的设置，nil代表不要滚动条。

   你也可以通过调用 `set-window-scroll-bars' 来为设置单独窗口的滚动条。

** 显示属性
   文本或者叠加的display属性用来在文本中插入图像，并且控制文字的显示效果。`display'属性的值是一个显示说明字串，或者包含多个显示设置的列表及向量。在同一个`display'属性中的多个显示设置同时作用于文字对象上。

   如果文本上有多个显示说明（叠加和文本属性），其中只有一个起作用，请查看`get-char-property'以了解更多。

*** 文本替换显示
    某些显示说明要在具有显示属性的文本中显示内容，这被叫作替换显示。Emacs不允许用户将插入点移动至已经被替换掉的文本中间。

*** 指定空白
    
** 图片显示

   要在Emacs中显示图片，首先需要创建一个图像描述符，然后在`display'中作为显示说明使用。

   Emacs只会在图形显示器上才能显示图像，在文本终端上不能显示图像，在一些不支持显示图像的图形终端上以及编译Emacs没有加入图像支持时，也不能显示图像。你可以使用`display-images-p'函数来查看原则上图像是否被支持。

** 按钮

按钮库定义了许多函数用于插入和维护可以响应鼠标和键盘的按钮。这些按钮的典型应用提各种超链接。

按钮本质上来说是一些文本或者叠加属性的集合绑定在buffer中的一断文字上。这些属性被称作“按钮”属性。属性之一，"action property"，设定了一个在用户用鼠标和键盘触发按钮的后被调用的函数。如果需要的话，动作函数可以检查按钮并使用其属性。

在某种意义上，按钮库复制了Wideget库的功能。其优点是，更快、更小、更简单。从用户的角度看，这两个库的提供的接口是非常相像的。

** 抽象显示

   Ewoc 库构造用

   ewoc 是一个用于结构
   ewoc 的buffer中的内容分为三部分，按顺序是：首先是固定的“header”，然后是一系列的数据元素的文本描述，最后是固定的“footer”。具体地说，ewoc包括以下这些信息：
   - 一个buffer
   - 在buffer中的起始位置
   - 头部和脚部字串
   - 节点组成的双头链，每个节点包含内容有
     - 数据元，是一个Lisp对象
     - 向前和向后的联结
   - 一个用于在buffer中插入展示数据的文本的“类打印机”。

典型作法是用`ewoc-create'来定义ewoc，然后将创建的结果传递给Ewoc库里面的其他函数，最后在buffer中展示结果。一旦结果展示在buffer中之后，其他函数检查buffer中的位置和节点，在结节中移动等等。

节点包装了数据就像变量一样。通常包装操作发生在将节点添加至ewoc的时候，你可以从节点中取回数据然后放一新的数据进去。像这样：

(ewoc-data NODE)
=>value

(ewoc-set-data NODE NEW-VALUE)
=>new-value

你也可以用Lisp对象或者索引号。

当数据改变时，你肯定想更新buffer中的文字，你可以使用`ewoc-refresh'来更新所有的节点，或者用`ewoc-invalidate'来改变节点，或者用`ewoc-map'带上参数来更新所有节点。同时你可以用`ewoc-delete'或者`ewoc-filter'来删除失效的节点。当删除节点的时候，同时也会从buffer中删除它的文本描述。

** 括号闪烁

   这节讲述的是Emacs是怎样实现在用户输入圆括号后进行闪烁的。

   变量： blink-paren-function
   变量的值是一个在输入成对字符的后半部分后要调用的函数。其值也可以是nil，意思是什么事也不用干。

   用户设置： blink-matching-paren
   如果其值为nil，则`blink-matching-open'什么也不会干。

   用户设置： blink-matching-paren-distance
   这个变量设置的是搜寻配对后括号的最远距离。

   用户设置： blink-matching-delay
   这个变量设置的是光标停留在与之配对的括号上面的时间。小于1秒时间看起来效果最好，但是在所有系统上的默认时间是1秒。

   命令： blink-matching-open
   这个函数是`blink-paren-function'的默认值。它假设输入的字符是前面某个符号的配对，并将光标移动到与之配对的字符上并停留一小会儿。如果其该字符要配对的字符不在屏幕上，则将其显示在回显区内。为了避免较长的延时，此函数搜索的距离不会超过`blink-matching-paren-distance'定义的距离。

   下面是一个明确调用此函数的倒子：

   #+BEGIN_SRC  elisp
           (defun interactive-blink-matching-open ()
            "Indicate momentarily the start of sexp before point."
            (interactive)
            (let ((blink-matching-paren-distance
                   (buffer-size))
                  (blink-matching-paren t))
              (blink-matching-open)))
   #+END_SRC

** 字符显示
   这一节讲述的是字符实际上是怎么显示出来的。通常，一个字符是作为一个“glyph”（在屏幕上占用一个字符宽度的图形符号）来进行显示的，它的表现形式决定于字符本身。例如：字符`a'显示出来也是`a'，但是有些字符显示出来就比较特别。例如： 格式字符（编码为12）被显示成两个图符的序列，`^L'，而换行符则开始一个新行。

   你可以通过修改“display table”（显示映射表）来控制每个字符显示出来的样子，这张表将每个字符编码映射成图符序列。

*** 常规显示

    下面是在没有显示映射表的情况下显示字符编码的约定。
    - 可打印的ASSII字符，按原样输出。
    - TAB控制符显示成具有tab长度的空格。变量`tab-width'控制每个tab字符占的空格的个数。
    - 新行符结束前面的行并开始新的一行。
    - 不可打印的ASSII控制符显示方式由变量`ctl-arrow'定义的两种方式中的一种决定。如果该变量的值不为nil，这些控制符就显示为两个图符的序列，其中第一个图符是`^'。例如：<DEL>字符显示成`^?'。
      如果 `ctl-arrow'的值是nil，这些控制符显示成八进制转义序列。
      
      这条规则同样同样适用于回车符（字符编码为13），但是回车符通常不显示在buffer的内容中，它被作为行尾转换符而忽略掉了。
    - 原始字节不是ASCII字符，这些字符显示成八进制转义序列，由四个图符组成。第一个图符是`\'，其他图符是字符的八进制编码。
    - 任何编码大于255的非ASCII字符，如果终端支持的话，按字符的原样显示。如果终端不支持，这些字符被称作非图符，通常用占位符在Emacs中显示。例如，如果图形终端没有字符的字体，Emacs通常显示一个包含有该字符的十六进制数的小方框。
      

上面这些显示约定在具有显示映射表，但有些字符在显示映射表中的条目为nil时仍然适用。所以，当你在编写显示映射表的时候，你可以只定义那些特别表现的字符。

下面这些变量决定某些字符在屏幕上如何显示。因为它们改变了字符占用的列宽，它们同样会影响用于缩进的函数、模式行的显示。如果你想用新的值强制重绘模式行，只要调用`force-mode-line-update'就行了。

用户设置： ctl-arrow
如果其值不是nil，控制符被显示成脱字符加一个字符的样子，如果其值为nil，则被显示成八进制转义序列。

用户设置： tab-width
这个变量的值是每两个tab停止点在Emacs中显示的空格数。单位是列，默认为8列。 *注意* 这个特征与`tab-to-tab-stop'命令使用的user-settable中的tab符互不影响。

*** 显示映射表
    显示映射表是一个用于特殊目的的字符表，用于覆盖字符的常规显示约定。这节讲述怎样制作、检查显示映射表，如何给显示映射表赋值。

    函数： make-display-table
    创建并返回一个显示映射表，表中所有元素的初始值均为nil。

    显示映射表上的普通元素是在索引字符编码；在C索引位置上的字符表示如何显示编码为C的字符。元素的值要么是nil，要么是图符向量。

    *警告* 如果你用显示列表来修改换行符的显示图符，整个buffer会被显示成一个整行。

    显示映射表还有六个可用于特殊目的的保留位置。下面是这些位置的意义，如果位置上的值为nil，则用下面说的默认效果。
    0 屏幕上用于表示截行的的图符，默认为`$'。在图形终端上，Emacs在边框上用箭头来表示截行，此时显示映射表没有意义。
    1 屏幕上用于表示续行的的图符，默认为`\'。在图形终端上，Emacs在边框上用弯箭头表示续行，此时显示映射表没有意义。
    2 用于表示跟在其后的是八进制数字的图符，默认是`\'。
    3 用于表示跟在其后的是控制符的图符，默认是`^'。
    4 用于表示其后存在不可见行的图符，默认是`...'。
    5 用于表示窗口边界的图符，默认是`|'。

    下面是在显示映射表中设置`ctl-arrow'为non-`nil'的例子。
    #+BEGIN_SRC elisp
     (setq disptab (make-display-table))
     (dotimes (i 32)
       (or (= i ?\t)
           (= i ?\n)
           (aset disptab i
                 (vector (make-glyph-code ?^ 'escape-glyph)
                         (make-glyph-code (+ i 64) 'escape-glyph)))))
     (aset disptab 127
           (vector (make-glyph-code ?^ 'escape-glyph)
                   (make-glyph-code ?? 'escape-glyph)))
    #+END_SRC

    函数： display-table-slot display-table slot
    此函数返回DISPLAY-TABLE中的SLOT。参数SLOT是0到5间的数字，或者是槽名。即`truncation', `wrap', `escape', `control', `selective-display',和 `vertical-border'之一。

    函数： set-display-table-slot display-table slot value
    此函数用于修改指定的DISPLAY-TABLE中特定SLOT的值。SLOT的取值同函数`display-table-slot'。

    函数： describe-display-table display-table
    函数返回关于显示映射表DISPLAY-TABLE的描述。

    命令： describe-current-display-table
    在help buffer中显示当前显示映射表的相关信息。

