notes/400-Meaning-兴趣/450-Emacs-神之编辑器/emacs-man-display.org
*** 激活显示映射表
    每个窗口或者buffer可以绑定一个显示映射表。窗口显示映射表的优先级高于buffer。如果两个表均不存在的话，Emacs会使用标准显示映射表，如果其中的元素为nil，则使用字符的常规显示约定。

    要注意的是，显示映射表会影响到模式行的显示，如果你想要强制重绘模式行的话，调用函数`force-mode-line-update'。

    函数： window-display-table &optional window
    返回窗口 WINDOW 的显示映射表，如果未设置则返回nil。

    函数： set-window-display-table window table
    把表格TABLE设置为窗口WINDOW的显示映射表。

    变量： buffer-display-table
    其值为buffer的显示映射表。如果为nil则没有设置。

    变量： standard-display-table
    其值为标准显示映射表，Emacs在找不到窗口显示映射表又找不到buffer显示映射表的时候会使用它。默认值为nil。

    `disp-table'库定义了许多的函数为修改标准的显示映射表。
    
*** 图符
    图符是一个图形符号，在屏幕上占用一个字符的宽度。每个图符在Lisp中用一个图符编码来表示，图符编码由一个字符和可选的样式组成。下面这些函数用来维护图符编码：

    函数： make-glyph-code char &optional face
    CHAR是图符编码中的显示字符，FACE是图符编成中的样式，样式可以设置成nil
    
    函数： glyph-char glyph
    此函数返回图符编码GLYPH中的显示字符。

    函数： glyph-face glyph
    此函数返回图符编码GLYPH中的样式，如果为空，则表示使用默认的样式。

你可以修改图符映射表来控制图符在如何在文本终端上显示的。但此特征要过时了，推荐用`glyphless-char-display'。  
    
** 声音
   这一节讲述的是Emacs是怎样用摇铃或者闪烁来引起用户注意的。使用声音要保守，频繁的响铃也会让人厌烦。不要在出错的时候总是用响铃是较为恰当。

   函数： ding &optional do-not-terminate
   此函数开启响铃或者闪烁屏幕。除非将DO-NOT-TERMINATE设置成non-nil，否则它会中断所有在运行中的键盘宏。

   函数： beep &optional do-not-terminate
   它是ding的近义词。

   用户设置： visible-bell
   这个变量告诉Emacs在响铃时要不要闪屏。nil意为否，其他意为是。这在图形显示终端上是有效的，在字符终端上使用Termcap软件包来定义可视响铃功能。

   变量： ring-bell-function
   如果其值不是nil，则应试是一个没有参数的函数，告诉Emacs该如何摇铃，并且其优先级要高于`visible-bell'。

** 窗口系统

   Emacs 能和许多的窗口系统进行配合，特别是X窗口系统。Emacs和X都使用“窗口”这个词，但是意义不同。Emacs中的frame才X中认为的单个窗口，而Emacs中的窗口在X中没有定义。

   变量： window-system
   此变量告诉Lisp程序Emacs正在用于显示frame的窗口系统。可能的值有：
   `x'
   `w32' MS-Windows GUI.
   `ns' Nextstep interface.(在GNUstep和苹果系统上使用)
   `pc' MS-DOS
   `nil' 字符终端

   变量： initial-window-system
   此变量中的值和`window-system'中的一样，用在Emacs启动过程中创建第一个Frame。

   函数： window-system &optional frame
   返回当前frame，或者指定的frame中基于的窗口系统。其值的意义同上面介绍的`window-system'变量的值。

   如果你想针对图形显示终端和字符显示终端写不同的代码，不要将 `window-system'和`initial-window-system' 作为谓语或者布尔变量。因为`window-system'不是一个Emacs运行系统的良好指示器。你应该用`display-graphic-p'或者其他`display-*-p'谓语。

   变量： window-setup-hook
   该变量是Emacs在处理完配置文件后运行的常规钩子。

   该钩子用于内部目的：配置与窗口系统之间的通信，创建初始窗口。用户不要干涉它。

** 双向显示

   Emacs 可以显示脚本文件，比如Arabic,Farsi和Hebrew，这些语言水平书写方向是从右向左。更是有，嵌入在从右向左的语言中的拉丁语和数字片断是从左向右显示的，相反方向的例子也一样。